blog/2021/ssh-agent.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 10:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title><code>ssh-agent</code></title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title"><code>ssh-agent</code></h1>
</header><p>
<a href="https://www.ssh.com/academy/ssh/agent">https://www.ssh.com/academy/ssh/agent</a>
</p>

<div id="outline-container-orgcdcdd6f" class="outline-2">
<h2 id="orgcdcdd6f">什么是 ssh-agent？</h2>
<div class="outline-text-2" id="text-orgcdcdd6f">
<p>
<code>ssh-agent</code> 是一个帮助程序，帮助记录用户们的身份密钥和对应的密匙。记录之后，用户便能够登陆对应服务器，而不需要重复输入密码或密匙。这是单点登陆（SSO，single-sign-on）的一种实现方式。
</p>

<p>
SSH agent 被用于 SSH 公钥验证。它使用 SSH 密钥进行身份验证。用户可以通过 <code>ssh-keygen</code> 新建 SSH 密钥，通过 <code>ssh-copy-id</code> 将对应的公匙上传至待登录服务器的 <code>.ssh/authorized_keys</code> 文件中。
</p>
</div>
</div>

<div id="outline-container-orged71d42" class="outline-2">
<h2 id="orged71d42">启动 <code>ssh-agent</code></h2>
<div class="outline-text-2" id="text-orged71d42">
<p>
在大多数 Linux 系统中， <code>ssh-agent</code> 是自启动的。如果未启动的话可以使用 <code>eval `ssh-agent`</code> 启动。为了允许通过密钥登录，需要开启公钥授权。这在 OpenSSH 中是默认开启的。由位于 <code>/etc/ssh/sshd_config</code> 文件中的 <code>PubkeyAuthentication</code> 选项确定。
</p>
</div>
</div>

<div id="outline-container-orgc75b386" class="outline-2">
<h2 id="orgc75b386">为 Agent 添加 SSH 密钥</h2>
<div class="outline-text-2" id="text-orgc75b386">
<div class="org-src-container">
<pre class="src src-sh">ssh-add ~/.ssh/id_rsa
ssh-add -l <span style="color: #706565;"># </span><span style="color: #857575;">list added keys</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5da85b" class="outline-2">
<h2 id="orge5da85b">转发 SSH Agent</h2>
</div>

<div id="outline-container-org468fd07" class="outline-2">
<h2 id="org468fd07"><code>ssh-agent</code> 命令</h2>
</div>

<div id="outline-container-orgaf7fea6" class="outline-2">
<h2 id="orgaf7fea6">延伸阅读</h2>
<div class="outline-text-2" id="text-orgaf7fea6">
<ul class="org-ul">
<li><a href="https://www.ssh.com/academy/iam/ssh-key-management">SSH Key Management</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>